projects/ClusterTest0/0/Cy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Cy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
10000
(
1.00166e-05
3.03843e-05
5.14321e-05
7.31827e-05
9.56596e-05
0.000118887
0.00014289
0.000167695
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
1.00166e-05
3.03843e-05
5.14321e-05
7.31827e-05
9.56596e-05
0.000118887
0.00014289
0.000167695
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
1.00166e-05
3.03843e-05
5.14321e-05
7.31827e-05
9.56596e-05
0.000118887
0.00014289
0.000167695
...
)
;
    }
    cathode
    {
        type            calculated;
        value           uniform 0;
    }
    anode
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
0.005
0.005
0.005
0.005
0.005
0.005
0.005
0.005
...
)
;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<scalar> 
20000
(
1.00166e-05
3.03843e-05
5.14321e-05
7.31827e-05
9.56596e-05
0.000118887
0.00014289
0.000167695
...
)
;
    }
}


// ************************************************************************* //
