projects/ClusterTest0/0/Y_CO2
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      CO2;
}

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.001;
    }

    outlet
    {
        type            zeroGradient;
    }

    wall
    {
        type            zeroGradient;
    }

    cathode
    {
        type            zeroGradient;
    }

    anode
    {
        type            zeroGradient;
    }
}
