projects/ClusterTest0/0/Y_H2
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      H2;
}

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    outlet
    {
        type            zeroGradient;
    }

    wall
    {
        type            zeroGradient;
    }

    cathode
    {
        type            faradaicMassFractionFlux;
        stoichCoeff     1;
        nElectrons      2;
        currentDensity  1;
        value           uniform 0;
    }

    anode
    {
        type            zeroGradient;
    }
}
