projects/ClusterTest0/0/Y_H2O
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      H2O;
}

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    inlet
    {
        // type            fixedValue;
        // value           uniform 0.999;
        type            inertMassFraction;
    }

    outlet
    {
        type            zeroGradient;
    }

    wall
    {
        type            zeroGradient;
    }

    // use calculate to enforce species conservation at boundaries as zerogradient overwrites this value otherwise
    cathode
    {
        type            calculated;
        value           uniform 1;
    }

    anode
    {
        type            calculated;
        value           uniform 1;
    }
}
